Revit 2027 API
ParameterTypeId.DivisionSketchCurveExtentdToSilhParam Property
 "Extend to Silhouette"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DivisionSketchCurveExtentdToSilhParam { get; }
Public Shared ReadOnly Property DivisionSketchCurveExtentdToSilhParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DivisionSketchCurveExtentdToSilhParam {
	ForgeTypeId^ get ();
}
static member DivisionSketchCurveExtentdToSilhParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace